[
  {
    "title": "α11 : mustard-seed",
    "author": "Aedaeum",
    "date": "2017-01-16T08:00:00.000Z",
    "dateUpdates": false,
    "content": "# major changes\r\n\r\n>- **New Font** - General site font changed to Nunito. The previous font was a little too \"cursivey\". This one looks a lot more professional.\r\n\r\n>- **New Changelog Look** - This changelog had seen better days. It was a bit too convoluted. More spacing and margins, as well as a background color has given it a bit of a face-lift.\r\n\r\n>- **Welcome to the Invite System!** - That's right, you can now request an invite directly through the site without needing to email anyone directly. The invite system allows `only 1 invite request per IP every 24 hours`.\r\n>- If you're thinking to yourself: _\"I don't see this invite page anywhere!\"_, it's probably because you're already logged in. Only guests can access the invite page.\r\n\r\n>- **Want to Know how Development is Going?** - For registered members, you can check out the new [Development Blog] page. I wanted a way to connect you directly to the development process of this site since Noumenae is not mine, but **ours**.\r\n>- Unfortunately, my life is quite hectic at the moment, so there will not be a defined schedule. I do plan on having one eventually though, _so stay tuned!_\r\n\r\n>- **New Rules!** - Just what you always wanted, more rules!! There is an ongoing [Discussion] about why the rules have been expanded to include legality. Signups are now an implicit agreement to these new legal rules. Don't worry though, this has nothing to do with going after members; it's there to protect Noumenae and associated persons against severe abuse of the site.\r\n>- In all likelyhood, this will not happen, but it's necessary as a: _\"just in case\"_ scenario.\r\n\r\n>- **New Loader Animation!** A loader animation has been universalized (is that a word?). Well anyway, it just means that there are no longer different animated [GIFS] when you're waiting for a resource to load. The new animation will look like a purple rippling pond.\r\n\r\n>- **New Form Controls!** - Input boxes, text areas, and buttons...have a new look that blends better with the flat minimalist style of the site.\r\n\r\n# fixes\r\n\r\n>- **FAQ** - The FAQ has undergone a tiny face-lift as well, to fix the scrolling issue and add some much needed readability updates.\r\n\r\n>- **Bad FireFox!!** - FireFox `Comfortaa` font rendering has been a tough cookie, but I ate it and _it was goooooood_. For those that don't understand...the [conflicts with FireFox] font rendering of Comfortaa, have been _\"fixed\"_.\r\n\r\n>- **Annoying Errors** - There was a vestigial notification system built into the logging mechanism which has now been removed. This was causing every error to popup a message - very annoying, even for me as a developer.\r\n\r\n>- **Console Double Post** - When losing a socket connection, the console would double-log it, as well as other events, whoops!\r\n\r\n# under the hood\r\n\r\n>- **Lovely Modals** - I re-wrote the modal code, which means no more lag.\r\n\r\n>- **Aurelia CLI Build System** - Now using Aurelia's built-in [CLI] to bundle,\r\n    which means no more [SystemJS] or [JSPM].\r\n\r\n>- **Fast Promises!** - Now using [BlueBird] promises. This came with the new Aurelia-CLI anyway, so it was convenient. If you want to learn about promises: [Promises Explained]\r\n\r\n>- **Entering the Modern Age** - Switched to **HTTP/2** protocol, which just means a bit more efficient website transfer and features I might utilize like [Server Push].\r\n\r\n\r\n>- **Inlined Assets** - This means everything necessary to run the site is bundled and served when a user requests the site. This means no loading times between pages, only one loading period when the site is first requested. There are still some exceptions, like this page which requires a server request for each changelog, but the delay is insignificant.\r\n\r\n\r\n[Development Blog]:/#/blog\r\n[Discussion]:https://github.com/Noumenae/client/issues/37\r\n[SystemJS]:https://github.com/systemjs/systemjs\r\n[JSPM]:http://jspm.io/\r\n[CLI]:http://aurelia.io/hub.html#/doc/article/aurelia/framework/latest/the-aurelia-cli\r\n[BlueBird]:http://bluebirdjs.com/docs/why-bluebird.html\r\n[Promises Explained]:https://spring.io/understanding/javascript-promises\r\n[Server Push]:http://blog.xebia.com/http2-server-push/\r\n[GIFS]:http://lmgtfy.com/?q=what+is+a+gif\r\n[conflicts with firefox]:https://github.com/Noumenae/client/commit/bcaacbfbfa83a6deab0511da797ce44e145dbcc5"
  },
  {
    "title": "α7 : neo",
    "author": "Aedaeum",
    "date": "2016-10-25T07:00:00.000Z",
    "dateUpdates": false,
    "content": "# ui-ux changes\r\n\r\n>- **Modals!!** - Not everyone knows what a modal is. It's an interactive popup window generated by JavaScript usually. There are CSS ones as well.\r\n\r\n>- **Dark Theme Forever** - Okay, so maybe not forever, but for the foreseeable future, the dark theme will be the default theme.\r\n\r\n>- **Everyone Likes to Scroll** - Dynamic scrollbars added that blend with the design of the site. These will be updated in the future.\r\n\r\n>- **Are you a Robot?** - When signing up, there will be a \"Robot\" check to make sure you're not an automated bot trying to log into the site.\r\n\r\n>- **Error Popups!** - Every once in a while if an error occurs, you'll get a small notification in the bottom right of the screen. You can click the 'X' to hide it.\r\n\r\n>- **Read EVERYthing** - The wording on the site has undergone many changes, so take your time with it, especially the FAQ.\r\n\r\n>- **Do you like Internet Explorer?** - I don't, and therefore there is no support for it currently. If you're using IE, you'll be prompted to download a \"real\" browser  *:P* Of course there are technical reasons why IE is not supported currently, opinions aside.\r\n\r\n>- **Who doesn't like Cute Sheep?** - When you hit a page that can't be found or you're not authorized to see, look out for the cute sheep!\r\n\r\n>- **New Logo and Icons** - You'll notice a brand new logo with, of course, a cute sheep.\r\n\r\n# new features\r\n\r\n>- **Are you Typing?** - When a user is typing, their Nickname will blink a certain color in the user list. When a user pauses typing mid sentence, the Nickname will blink a different color.\r\n\r\n>- **Everyone Emotes!** - The Chat now supports emotes, not to be confused with emoticons. When you type the `/me` command followed by some text like this: `/me likes owls`, everyone will see a special message that says `<you> like owls` where `<you>` is replaced with your Nickname.\r\n\r\n>- **Don't like your Nickname?** - Change it with the `/nick` command.\r\n\r\n>- **Invite Only!** - To take the strain off the current testing phase of the site, I've decided to make the site invite-only. This will be pending on the overall popularity of the site and its resources.\r\n\r\n>- **Sign In? What's That?** - I know, there was no way to actually Signup or Login to the site. This is no longer the case. It took a lot of revisions and updates, but it's finally here. You can login with either a Facebook or Google+/Gmail account.\r\n>- This is a bigger discussion, but for right now these are the only ways to login. Eventually I plan on having a login system that incorperates more social networks and a method for those who have no social network accounts.\r\n\r\n>- **Did Someone Say Changelog?** - You're reading it right now! This section will only be updated with major releases and will generally be a decent length, so buckle up.\r\n>- If you would like to know about the day-to-day changes or quick fixes that pop out from time to time, you can request the repo link in chat and I just _might_ give if to you if you're _special_ enough _:P_\r\n\r\n# look forward to\r\n>- **Fixes** - General fixes and tuning of the site.\r\n\r\n>- **Stats** - Stats may or may not be visible, but they will be tracked.\r\n\r\n>- **Chat Notices** - And possibly, maybe... [notices]\r\n\r\n# bits and bobs\r\n\r\n>- **Lotsa Names** - The site has gone through about 3 name changes: Amenaeble, Noumaenon,\r\nand finally [Noumenae].\r\n\r\n\r\n[Noumenae]:/#/home/faq/noumenae\r\n[notices]:/#faq/notice"
  },
  {
    "title": "α24 : chrome-i",
    "author": "Aedaeum",
    "date": "2018-04-20T08:00:00.000Z",
    "dateUpdates": false,
    "content": "# qol features\r\n\r\n>- **More Readability** - Default text color was hiding too much into the background. It should be **much** easier to read now.\r\n\r\n>- **Spacious Rules** - The rules page has a lot of good information, but it was all slammed together; each rules *\"personal space\"* has been increased.\r\n\r\n>- **Consistency Abounds** - The whole site has undergone a consistency check to make sure that all margins, all text alignments, and colors are consistent with each page and action.\r\n\r\n>- **FAQ 2.0** - Although the FAQ page was already pretty snazzy, I decided to make it not only _easier to read_, but also easier for me to update!! This also includes URL support, so you can link to your favorite questions! Well, maybe that's more for me than it is for you...but what is for you, are the **new highlight blocks**, purple for _work-in-progress_ information and gold for _**the-most-important**_ information.\r\n\r\n>- **Are you Idle or Active?** - That is the question! And now that question can be answered because the server and client share that information. Your new idle/active stats will be updated when you toggle from idle to active.\r\n\r\n>- **What level are you?** - Is a question you can now ask yourself. Unfortunately you won't be able to answer that question, because as of right now there is no way to actually view your level. That will come in the next update.\r\n>- Levels are gained by simply chatting on the site, but to prevent spam, you only gain [XP] every 45 seconds.\r\n>- If you want to get a sneak peek at what stats will be available in the future, check out this issue [here](https://github.com/Noumenae/server/issues/25). You might not know what some of those stats are, but they will be revealed in time.\r\n\r\n# chat commander redux\r\n\r\n>- **Yes, New** - The chat commander (input box on chat page) has undergone an impressive rewrite, which leaves it almost unrecognizeable to its former self. That being said, it behaves almost identically to its previous version, however, with precision.\r\n>- Each feature that existed before this update is still present, but now works on _all supported browsers_ flawlessly. It's not only bug-free but also easier to update with new features.\r\n\r\n>- **Play it again Sam** - After sending a message or command, it will be saved in a temporary history so that when you hit the `UP arrow` on your keyboard, the previous message or command will be immediately put back into the chat box.\r\n>- Repeatedly hitting the `UP arrow` will cycle **up** through the history of messages or commands that you've sent. Likewise, hitting the `DOWN arrow`, will cycle **down** through the history.\r\n>- The history only saves up to 30 items and will disappear once you navigate to another page or exit the site.\r\n\r\n>- **Grammar Nazi Ahead!** - This feature now works across browsers. As you type, commonly misspelled words will be corrected. For instance: `teh` will be corrected to `the`. Also when typing `i` by itself, it will be capitalized to `I`.\r\n>- At some point, this feature will be optional, but for testing purposes it will be left on until full release.\r\n\r\n>- **Need a Hint?** - As you type a command, a hint will appear so you can quickly complete the command by hitting the `TAB` or `ENTER` key on your keyboard. This allows you to type as little as 2 or 3 characters to enter a command.\r\n\r\n# internals\r\n\r\n>- **Persistent Updates!** - Basically when the site gets an update, it requires the user to refresh, but this doesn't work if the site is loaded from the browser [cache]. So to get around this, I've [busted] your cache. This allows a _programmatic_ or _user_ initiated refresh of the page to load the new version of the site.\r\n>- Originally when I updated the site, I would have to log into my [CDN] (cloudflare) and manually bust the cache by telling it to purge all files. After this update, I will no longer have to do that.\r\n\r\n>- **Database Revamp** - You, the user, won't recognize any changes with this update but because the database code got updated, it means your new stats are ready to be implemented for the next release cycle.\r\n\r\n# fixes and security\r\n\r\n>- **Server message fiasco** - There was a bit of code that allowed a savvy user to send server messages to everyone. That hole has been thoroughly plugged.\r\n\r\n>- **Firefox Shenanigans** - As usual this browser likes to stand out in all the worst ways. The hint completions are mostly fixed, but a second round of cleaning up its mess in the content-editable-div, is necessary.\r\n\r\n\r\n[cdn]:https://www.incapsula.com/cdn-guide/what-is-cdn-how-it-works.html\r\n[cache]:https://en.wikipedia.org/wiki/Cache_(computing)\r\n[busted]:https://www.keycdn.com/support/what-is-cache-busting/\r\n[xp]:#/home/faq/what-is-xp"
  },
  {
    "title": "α36 : unreleased",
    "author": "Aedaeum",
    "date": "2019-01-01T00:00:00.000Z",
    "dateUpdates": false,
    "content": "\r\n# new layout\r\n\r\n>- **Paginated Deliciousness** - The _Changelog_, _FAQ_, and _Blog_ pages have been converted to a new layout. These pages have dynamic data which will be converted into a nice looking layout for you to peruse.\r\n>- Accompanying the new look, is the ability to link to each of the dynamic pages. `CLICKING` a change log will now change the URL and you can share that URL with **anyone**!"
  },
  {
    "title": "α12 : fate",
    "author": "Aedaeum",
    "date": "2017-07-25T08:00:00.000Z",
    "dateUpdates": false,
    "content": "# features\r\n\r\n>- **Scrollbars Everywhere!!** - That's right, we've got delicious scrollbars everywhere, including modals. There's currently a [discussion] about the numerous issues I've had with styling the scrollbars, while trying to maintain good functionality over multiple devices and configurations. Long story short, I had to compromise but I think it will pay off in the future.\r\n\r\n>- **Changelog Facelift** - At first I was just going to convert all logs into [Markdown] files; that was my [goal]. But as usual I started tinkering, and ended up [bedazzling] the changelog. Oh yeah...it's quite different than it used to be, but I think it's much easier to read this way.\r\n>- Go ahead and hover your mouse over each of these sections and you'll see something fascinating _:P_ There's also a nice loading animation if a log is taking a while to load.\r\n\r\n>- **Chat styles v2** - Let's be honest, the chat window was primarily one color and blended a little too much into the interface, losing some obvious compartments. I've staggered the colors between messages, user list, and input box so that it appears more dynamic; as a result, message colors now appear more vibrant as well.\r\n>- One of my favorite changes however, is that Auto-scroll will no longer interrupt you when you try to scroll up through old messages. An honerable mention is also the allowance of [Markdown] in messages for basic message formatting. _Wanna bold or italisize text?_ **Now you can!**\r\n>- Last but not least, messages sent in quick succession will simply append to the previous message block _yay!_ It was much easier than I thought it would be, however there is a caveat. Time data for those messages are lost. I will fix this in the future, but just be aware that if you repeatedly send messages before anyone replies, you will only see the time for the first message in the block.\r\n\r\n>- **User List Love** - Yes, I've finally gotten around to updating the user list with a context menu. It displays ping and user group currently, but with future support for any other stats that should be easily accessible. Just **right click** on any user in the user list to access the context menu.\r\n\r\n>- **Notices!** - Finally they're here. You are now able to [notice] users, which is not unlike sending a private message, but instead of the message being sent to some special window, it all appears in the main chat. Read more about notices [here](/#faq/notice).\r\n>- To notice a user, just **double click** their name in the user list; it will fill your input with a **command** and **ID**. It will look something like `/notice zh882Egs8QJpK6aAAAf `. Just start typing your message and hit enter to send it. Don't worry about not getting a confirmation, that's just how it works for now.\r\n>\r\n>- _In the future you'll get a message saying that your notice was sent successfully_.\r\n\r\n# fixes\r\n\r\n>- **Stop that Flicker!** - There was an issue with flickering when you navigated to the different home tab pages. This flickering was due to transitioning transparent to non-transparent colors.\r\n\r\n>- **Transparent what?** - During the creation of the site, I had the _brilliant_ idea to make all colors transparent for \"theming\" purposes, which in hindsight was...well...short-sighted _:P_\r\n>- All colors have been converted to solid colors. There are no more pointless transparent colors on the site. This is a fix, because any transitions from `transparent -> solid` resulted in wonky animation.\r\n\r\n# bits and bobs\r\n\r\n>- **FAQ page shinanigans** - Unfortunately the faq page is in dire need of a better mechanism for displaying content. Right now I'm updating it with _raw code_, which is just annoying and leaves no room for fancy transitions between topics. This will be addressed in the next update.\r\n\r\n# under the hood\r\n\r\n>- **Markdown** - It's not particularly obvious, but most of the pages on the site have been converted to [Markdown]. This means I don't have to write raw html to update certain pages anymore. This will speed up development.\r\n\r\n>- **Ping, Pong** - Back in the day, when real-time communication was much more difficult, there was a _ping-pong_ message that ensured the client was still connected to the server. The server would send a _ping_ message and the client would return a _pong_ message. If the server did not recieve a _pong_ message within a certain amount of time, the server would disconnect and/or cleanup the client connection.\r\n>- Thankfully such shinanigans are not necessary these days, but...without a series of ongoing _send-recieve_ transactions, there's no way to accurately measure [latency]. So even though it's not necessary from a design standpoint, it's still very helpful for getting an accurate measurement of a clients [latency] to the server. This allows your ping to be measured in the new user context menu.\r\n>\r\n>- _Other real-time stats will piggy-back on this method like: away status, idle time, and message activity_\r\n\r\n\r\n[discussion]:https://github.com/Noumenae/client/issues/46\r\n[goal]:https://github.com/Noumenae/client/issues/39\r\n[markdown]:https://guides.github.com/features/mastering-markdown/\r\n[bedazzling]:https://www.google.com/search?q=what+is+bedazzle\r\n[notice]:/#faq/what-is-a-notice\r\n[latency]:http://whatis.techtarget.com/definition/latency"
  }
]