[
  {
    "date": "2018-05-02T23:32:06.768Z",
    "title": "creation of noumenae",
    "content": "\r\nHi, my _alias_ is **Aedaeum** and I coded **Noumenae** from the ground up. If you want to know more about me, go ahead and google my alias and you'll find me all over the internet.\r\n\r\n# ?: what does noumenae mean\r\n\r\nNoumenae is an invented word from the root word _Noumena_. [Noumena] has a very difficult definition to wrap ones mind around, but once understood, can lead to some very fulfilling realizations.\r\n\r\n## noumenal reality\r\n\r\nThis is likened to the [Allegory of the Cave] by **Plato**; we are experiencing shadows of things but not the things themselves. A [thing-in-itself][thinginitself] defines its interaction with us as _Noumena_; **something that cannot be grasped by our sensory perceptions, but only through intuition**.\r\n\r\nIt is my personal belief that what we percieve as **God**, communicates to us through this Noumenal reality. _We are children interpreting the shadows and echoes of_ **God**.\r\n\r\n## the ae in noumen-ae\r\n\r\n\"ae\" in scottish means \"one\". Couple this with **Noumena** or **Noumenal** and you get _The Real One_ or _The Real Reality of One_. The concept behind the site is to experience a oneness with each other, which will hopefully get us one step closer to living in the Noumenal.\r\n\r\n# ?: what motivated you to create noumenae\r\n\r\nThe simple answer is **Love**. No, not the kind of love that just wants to feel needed, but the kind of love that's tired of seeing its people trampled on. There is a _deep ache_ in all of us for **Truth** but not a lot of places to talk about it. The implications of what **Truth** really is for every one of us, should be an _open honest discussion_, **not** a court of judgment or criticism.\r\n\r\n> **Noumenae** exists to destroy the paradigm that there is only one acceptable way to **Truth**\r\n\r\n\r\n[allegory of the cave]:https://faculty.washington.edu/smcohen/320/cave.htm\r\n[thinginitself]:https://en.wikipedia.org/wiki/Thing-in-itself\r\n[noumena]:http://www.dictionary.com/browse/ontic"
  },
  {
    "date": "2018-05-03T00:09:33.364Z",
    "title": "about the faq",
    "content": "\r\nYou'll notice in the _top-left_ of this panel, there is a search box. Typing in that box will filter the FAQ questions. Clicking on any of the questions on the left, will replace _this area you're reading right now_, with the answer of the question you clicked.\r\n\r\nAnother handy feature is the _hover_ feature of these individual paragraphs. Go ahead and hover your mouse over this paragraph; it should light up. This will allow you to keep your place while reading, as well as make the text stand out more.\r\n\r\nUsing the forward and back buttons on your browser or mouse, will allow you to flip through the browser history of clicked questions. To test this out, click any of the questions on the left, then hit the back button on your browser or mouse. You should be navigated back to this answer.\r\n\r\nThe FAQ will often reference other answers using links. Clicking [What is XP] or [What are Levels] will immediately replace this answer with the answer of those questions. You can always come right back to this answer by hitting the back button on your browser or mouse; **Try it now!**\r\n\r\nExternal links look identical to page links, but they will open up a _new Window or Tab_. Here is the [Definition of a Cat]. After you're done looking at the definition, _you can close that tab/window_ and you should be looking at this page again.\r\n\r\n> Messages like this are to highlight important information\r\n\r\n##### WIP : Messages like this give work-in-progress information about a feature or function\r\n\r\n**That's all there is to it! Enjoy the FAQ!**\r\n\r\n[what is xp]:#/home/faq/about-xp-for-levels\r\n[what are levels]:#/home/faq/leveling\r\n[definition of a cat]:http://www.dictionary.com/browse/cat"
  },
  {
    "date": "2018-05-03T00:10:12.373Z",
    "title": "common expressions",
    "content": "\r\nThese are phrases or words that the site will use to describe certain aspects of itself or its userbase.\r\n\r\n# ?: what is nsfw\r\n\r\n_NSFW_ is an acronym for **Not Safe for Work**. This is commonly used to describe material that isn't suiteable to contructive content. This can include offensive language or potentially offensive images or articles.\r\n\r\n> NSFW content is contextual to the conversation, so just use reason when posting such content\r\n\r\n# ?: what is aurelia\r\n\r\nAurelia is the front-end [MVVM] framework that drives the user experience on Noumenae.\r\n\r\n# ?: what is node\r\n\r\nNode is the back-end server architecture that drives user content on Noumenae\r\n\r\n[mvvm]:https://www.wintellect.com/model-view-viewmodel-mvvm-explained/"
  },
  {
    "date": "2018-05-03T00:08:35.357Z",
    "title": "how the invites work",
    "content": "\r\nInvites are given out by the Admin as well as those who have established some integrity on the site. That being said, you're _free to email the Admin_ as described on the [about] page.\r\n\r\n> The Requirements below are just loose guidelines; **content of character** is most important.\r\n\r\n# ?: what are the requirements\r\n\r\nNoumenae is a harbor for those who feel their flesh isn't all there is, especially when that **flesh is tearing at your soul**. All of us are struggling with _something_, desiring a solace from worry and doubt. This restlessness that we feel from the depth of our being, this _nagging tug_...if you feel such a pull, then **Noumenae** might be what you're looking for.\r\n\r\nWe call this invisible tension _God_ or _Spirit_ or _Divine_ and we deem it **unseen** or **unknown**. Even though we don't see and we don't know, deep down we feel we _should_ see and _should_ know. If these are the kinds of questions you're asking, the kind of life you're living, or the kind of thoughts you're pondering, then fill out the [Invitation Form].\r\n\r\n# ?: why invite only\r\n\r\nThere are three reasons **necessary** for this decision. The first is that there are _too many people_ on the internet who enjoy abusing free services. That is the world we live in and as such, I must take that into consideration.\r\n\r\nThe second, is that with an invite system, we are able to filter out individuals that might pose more harm than good to the site. **This has nothing to do with abuse**, but individuals that simply don't have the same moral foundation we expect of ourselves. Although the restrictions will be leniant, certain individuals will provide too much friction to be beneficial.\r\n\r\nThe third and final reason, is traffic. Early on in the development of this site, there are going to be traffic restrictions. As more and more people are added, this introduces potential for failure depending on the increase in IO on the server. Once I can assess the average strain per-user on the site, then I can remove this restriction and possibly have higher tier members start inviting more people. _This is all pending overall interest._\r\n\r\n[about]:#/about\r\n[invitation form]:#/invites"
  },
  {
    "date": "2018-05-03T19:33:03.523Z",
    "title": "leveling",
    "content": "\r\nWhen we talk about levels in **Noumenae** we're talking about **Message Levels**. When you send a message using chat, you have a chance to gain some [XP] towards the next level. Each level comes with its own name and each name relates to how invested a user is in chatting.\r\n\r\n> Higher level does NOT mean better messages; it just means more time spent chatting.\r\n\r\n## level names\r\n\r\n- Roused\r\n- Curious\r\n- Spirited\r\n- Beholden\r\n- Ardent\r\n- Vested\r\n- Devout\r\n- Impassioned\r\n- Fervid\r\n- Eminent\r\n- Celestial\r\n- Immortal\r\n- Omnicient\r\n\r\n##### WIP : Level names are subject to change.\r\n\r\n[xp]:#/home/faq/about-xp-for-levels"
  },
  {
    "date": "2018-05-02T23:29:07.169Z",
    "title": "associated persons",
    "content": "\r\nAssociated persons are only the Owner(s) and Admin(s) on Noumenae. It is important to note that Moderators and VIPs are not \"associated persons\"."
  },
  {
    "date": "2018-05-03T00:11:24.690Z",
    "title": "about bans",
    "content": "\r\nA ban is when a user is _temporarily_ or _permanately_ **blacklisted** from being a user of **Noumenae**. Banned users will not be able to login to the site, but they can still view any of the static pages that do not require a login.\r\n\r\nBecause **Noumenae** is an _invite-only_ service, Bans are **highly unlikely** to be necessary. That being said, temporary Bans might be used in extreme cases. If a user tries to login during a temporary ban, they will be shown the countdown time until they are unbanned.\r\n\r\nThere will be no Banning over the proverbial _\"spilt milk\"_. Banning is reserved for **repeated**, severe infractions of the [Rules].\r\n\r\n> No bans will be given out unless absolutely necessary.\r\n\r\n##### WIP : Bans are currently impossible\r\n\r\n[rules]:#/rules"
  },
  {
    "date": "2018-05-03T00:11:36.640Z",
    "title": "about kicks",
    "content": "\r\nA kick is when a user is forceably removed _from a channel_ on the chat server for a specific duration, set by an **Admin** or **Moderator**. A **kick** is temporary and you may join the channel again when the duration has expired.\r\n\r\n> Trying to repeatedly join the channel after you have been kicked will increase the duration\r\n\r\n##### WIP : There will be an obvious time limit for channel kicks eventually\r\n\r\n##### WIP : Kicks are currently impossible"
  },
  {
    "date": "2018-05-03T00:11:55.162Z",
    "title": "about loves",
    "content": "\r\n**Love** is a big part of **Noumenae** and as such, it is a trackable stat on the site; however, it is free. There are no limitations on how much **Love** one can give or recieve. **Noumenae** encourages that **Love** be given when any user contributes something meaningful to you personally. When you give **Love**, it will increase not only their love stat, but your _love-given_ stat.\r\n\r\nOriginally **Love** points were going to be aquired over time and extremely rare and valuable, but I realized this would have been the creation of anti-love. **Love** now has no intrinsic value except that which you place on it; _as it should be_.\r\n\r\n> Contrary to **Love's** original concept, it will no longer increase **Renown**.\r\n\r\n##### WIP : Users will receive 999 love to give per 24 hours; only if they're empty.\r\n\r\n##### WIP : This feature is currently not available\r\n\r\n[renown]:#/home/faq/renown"
  },
  {
    "date": "2018-05-03T00:13:16.295Z",
    "title": "about notices",
    "content": "\r\nWhen sending a message to a channel, everyone sees it. Notices allow you to single out one person in a channel and send them a message directly. The difference between this kind of message and a **private message**, is that a notice is channel-specific. You can only send a notice to a user if they're _in the same channel as you are_.\r\n\r\nYou can think of it like an inline private message to someone. It's not sent to an inbox or a special window; it's sent directly to the channel like all messages. The difference being that only the person you specified will see it, because their socket (connection) is the only one that will have access to it.\r\n\r\nYou're probably wondering _Well how do I notice someone?_ This is very simple. All you have to do is **double click** a users name in your user list. This will cause your input box to now contain a command and ID. Just start typing your message and hit enter. Don't worry about not getting a confirmation, that's just how it works right now. In the future you'll get a message saying that your notice was sent successfully.\r\n\r\n##### WIP : The current method by which you send a notice will be updated in the future to be much more user friendly."
  },
  {
    "date": "2018-05-03T00:13:50.808Z",
    "title": "about warnings",
    "content": "\r\nA warning means an Admin or Moderator has deemed a user defiant or seriously neglegent regarding the rules. Once a user accrues enough warnings, more serious measures - _a kick or ban_ - will be considered.\r\n\r\n##### WIP : Warnings are currently impossible"
  },
  {
    "date": "2018-05-03T00:13:30.405Z",
    "title": "about silences",
    "content": "\r\nA silence is when an **Admin** or **Moderator** decides to mute a user for inappropriate content or behavior. The duration of the mute depends on the severity of the infraction. _Most mutes will only last 15 - 300 seconds_.\r\n\r\nWhile a user is muted, they may view but not participate in the chat. A silence will generally happen when a user is flooding the chat repeatedly (too quickly or with repeated content).\r\n\r\n> Admins and Moderaters are very lenient; it will be deserved\r\n\r\n##### WIP : A Silence is currently impossible"
  },
  {
    "date": "2018-05-03T00:14:25.248Z",
    "title": "about upvotes",
    "content": "\r\nLike other sites, an upvote simply means you enjoyed a users message. It doesn't have to be profound, but it should contribute _something_ to the conversation, even if it's just humor or irony.\r\n\r\n> This feature is unlocked when a user reaches the level of _Spirited_\r\n\r\n##### WIP : This feature is currently not available"
  },
  {
    "date": "2018-05-03T00:14:12.418Z",
    "title": "about abuses",
    "content": "\r\nAbuse is similar, but **not** the same as a down-vote. _Down-voting_ in most systems is a way for a user to express their general dislike for a message, warranted or unwarranted. **Abuse** however, means a _user has knowingly ignored the site rules and/or is abusing other users on the site_. Giving an abuse modifier is **not to be taken lightly** and as such, will require users to input a small message as to why they are assigning abuse.\r\n\r\n##### WIP : This feature is currently not available\r\n\r\n[level]:#/home/faq/level"
  },
  {
    "date": "2018-05-03T00:15:11.720Z",
    "title": "about renown",
    "content": "\r\nRenown is an abstract calculation of a users impact on the site. It can be increased through not only activity on the site, but various interactions between users.\r\n\r\n> You can gain Renown by chatting, collecting sheep, and recieving upvotes on your messages.\r\n\r\n# ?: what is its purpose\r\n\r\n_Feedback_; it's nice to recieve compliments and make friends, but those relationships are subjective. _Renown_ is an objective way to quantify contribution to **Noumenae** and its members. _Renown_ allows others to see how you've impacted the site regardless of your interaction with them.\r\n\r\n# ?: why is gaining renown slow\r\n\r\nYou should think of _Renown_ as something attained over a vast amount of time. If you think of **Heroes** or **Legends** having _immense Renown_, it's because of all they achieved in their lifetime, not a single solitary act. This is the way in which you should view _Renown_.\r\n\r\n_Almost_ everything you do on the site, gives you a portion of _Renown_. Your dedication to the site and its members will reflect in it. Accrue enough and you just might get something special...\r\n\r\n> That **Something Special** is still a WIP and will be available at a much later date."
  },
  {
    "date": "2018-05-03T00:15:43.087Z",
    "title": "about xp for levels",
    "content": "\r\n**XP** stands for **Experience Points** and you gain them by chatting; however, _you can only gain XP every 45 seconds_. After each message you send, there is a _45 second period_ where you can't gain anything from sending messages. Once this period has elapsed, your next message will cause you to gain XP again.\r\n\r\n# ?: why not gain xp for every message\r\n\r\nThis is not only to prevent spamming, but also to roughly timestamp levels. Because _it takes 45 seconds to gain XP_, there's a limit on how quickly you can level. As an example, the current calculation for the first level progression is _~1 hours worth of messages_. **This prevents rapid leveling for those who have lots of time on their hands**.\r\n\r\n> No matter how much time someone has, it will take **~1 hours worth of messages to get to level 2**.\r\n\r\nYou may be thinking that _1 hour_ isn't very much time, but that's only if you're **consistently** sending a message every 45 seconds. Most people chat in bursts and long pauses, so the chances of anyone sending a message for every 45 second period perfectly, is near impossible without a bot.\r\n\r\n##### WIP : The XP simulation used to deduce chat habits is imperfect and will be subject to change. An hours worth of time right now, might be 45 - 85 minutes worth of time with new data."
  },
  {
    "date": "2018-05-03T00:14:53.315Z",
    "title": "what is a family",
    "content": "\r\nA family takes your hand when you can't move; a family knocks you off that _\"high horse\"_; a family knows how to _love the joy and the hurt_; a family _embraces_ all its members as one; a _real_ family pushes you to run **headlong** into life, without a care for how it looks to others.\r\n\r\nFor me, and I think for many, a family stands on _the strength_ of _the belief_ in _the Self_. The Self is that part of us which holds the key to creativity and fulfillment. It's the families job to pull that out of each other.\r\n\r\n> Of course this is just my opinion, your mileage may vary"
  },
  {
    "date": "2018-05-03T00:12:55.032Z",
    "title": "who is a member",
    "content": "\r\nA member is an official user of **Noumenae** who has signed up through the [Invitation Process] and accepted the [Rules].\r\n\r\n> By going through the \"signup\" process, the user has become a member of Noumenae\r\n\r\n[rules]:#/rules\r\n[invitation process]:#/home/faq/how-do-invites-work"
  }
]